README.org
#+author: Alejandro Gallo
#+title: Wavecar.hpp
#+options: num:nil
* Wavecar.hpp
  :PROPERTIES:
  :header-args:c+++: :tangle include/Wavecar.hpp
  :header-args:c+++: :main no
  :END:
** Introduction
This package implements a C++11 header-only library
for reading =WAVECAR= files in the =VASP5= format.

It is written as a literate program cite:LiteratePrograKnuth1984,
so we will try to keep the documentation and the code in the same place.

As a convenience you can find the header file in the =include= directory.

** Header
We will only need libraries available in the standard library:

#+begin_src c++
#include <iostream>
#include <fstream>
#include <map>
#include <array>
#include <assert.h>
#include <string>
#include <numeric>
#include <algorithm>
#include <vector>
#include <math.h>
#include <complex>
#+end_src

