README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-03 Wed 18:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wavecar.hpp</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alejandro Gallo" />
</head>
<body>
<div id="content">
<h1 class="title">Wavecar.hpp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga9c0de9">Wavecar.hpp</a>
<ul>
<li><a href="#orgb0ec54e">Introduction</a></li>
<li><a href="#org6d4d7bd">Header</a></li>
<li><a href="#orgd600491">Main types</a></li>
<li><a href="#org4ec7b60">Mathematical functions</a>
<ul>
<li><a href="#org30bd0be">Products</a></li>
<li><a href="#org3d1bc99">Cell volume</a></li>
<li><a href="#org840f777">Reciprocal cell</a></li>
</ul>
</li>
<li><a href="#org3fd2b25"><code>WAVECAR</code> parsing</a>
<ul>
<li><a href="#orgf5ea680">Understanding the code</a></li>
<li><a href="#org9278043">Wave descriptor</a></li>
<li><a href="#org64614c5">Header</a></li>
<li><a href="#orgdc45c33">The whole <code>WAVECAR</code></a></li>
</ul>
</li>
<li><a href="#org9212da8"><code>WAVECAR</code> writing</a>
<ul>
<li><a href="#orgc91b19e"><code>CellVector</code></a></li>
<li><a href="#orgea788c4"><code>Cell</code></a></li>
<li><a href="#org126ed2f"><code>WavecarHeader</code></a></li>
<li><a href="#org5971b0e"><code>WaveDescriptor</code></a></li>
<li><a href="#orgc913909"><code>Wavecar</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org483a423">Tests</a>
<ul>
<li><a href="#orgc8312dd">Main function</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga9c0de9" class="outline-2">
<h2 id="orga9c0de9">Wavecar.hpp</h2>
<div class="outline-text-2" id="text-orga9c0de9">
</div>
<div id="outline-container-orgb0ec54e" class="outline-3">
<h3 id="orgb0ec54e">Introduction</h3>
<div class="outline-text-3" id="text-orgb0ec54e">
<p>
This package implements a C++11 header-only library
for reading <code>WAVECAR</code> files in the <code>VASP5</code> format.
</p>

<p>
It is written as a literate program <a class='org-ref-reference' href="#LiteratePrograKnuth1984">LiteratePrograKnuth1984</a>,
so we will try to keep the documentation and the code in the same place.
</p>

<p>
As a convenience you can find the header file in the <code>include</code> directory.
</p>
</div>
</div>

<div id="outline-container-org6d4d7bd" class="outline-3">
<h3 id="org6d4d7bd">Header</h3>
<div class="outline-text-3" id="text-org6d4d7bd">
<p>
We will only need libraries available in the standard library:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">iostream</span><span style="color: #145c33;">&gt;</span>
<span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">fstream</span><span style="color: #145c33;">&gt;</span>
<span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">map</span><span style="color: #145c33;">&gt;</span>
<span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">array</span><span style="color: #145c33;">&gt;</span>
<span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">assert.h</span><span style="color: #145c33;">&gt;</span>
<span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">string</span><span style="color: #145c33;">&gt;</span>
<span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">numeric</span><span style="color: #145c33;">&gt;</span>
<span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">algorithm</span><span style="color: #145c33;">&gt;</span>
<span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">vector</span><span style="color: #145c33;">&gt;</span>
<span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">math.h</span><span style="color: #145c33;">&gt;</span>
<span style="color: #a0132f;">#include</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">&lt;</span><span style="color: #2544bb;">complex</span><span style="color: #145c33;">&gt;</span>
</pre>
</div>
</div>
</div>
