README.html

<div id="outline-container-orgd600491" class="outline-3">
<h3 id="orgd600491">Main types</h3>
<div class="outline-text-3" id="text-orgd600491">
<p>
We define the main structure for the WAVECAR header,
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #5317ac;">using</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">CellVector</span><span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">array</span><span style="color: #145c33;">&lt;</span><span style="color: #005a5f;">double</span>,<span style="color: #2f4f4f;"> </span>3<span style="color: #145c33;">&gt;</span>;

<span style="color: #5317ac;">struct</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">Cell</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">array</span><span style="color: #5317ac;">&lt;</span><span style="color: #005a5f;">CellVector</span>,<span style="color: #2f4f4f;"> </span>3<span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">basis</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">double</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">volume</span>;
<span style="color: #145c33;">}</span>;

<span style="color: #5317ac;">struct</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">WavecarHeader</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">recordLength</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">nSpin</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">version</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">nKpoints</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">nBands</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">encut</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">double</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">eFermi</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">nPlaneWaves</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">Cell</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">real</span>,<span style="color: #2f4f4f;"> </span><span style="color: #00538b;">reciprocal</span>;
<span style="color: #145c33;">}</span>;

<span style="color: #5317ac;">using</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">KPoint</span><span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>CellVector;
<span style="color: #5317ac;">using</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">OrbitalCoefficients</span><span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #145c33;">&lt;</span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">complex</span><span style="color: #5317ac;">&lt;</span><span style="color: #005a5f;">double</span><span style="color: #5317ac;">&gt;</span><span style="color: #145c33;">&gt;</span>;
<span style="color: #5317ac;">struct</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">VerticalBand</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #5317ac;">&lt;</span><span style="color: #005a5f;">double</span><span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">realEnergies</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #5317ac;">&lt;</span><span style="color: #005a5f;">double</span><span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">imagEnergies</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #5317ac;">&lt;</span><span style="color: #005a5f;">double</span><span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">occupancies</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #5317ac;">&lt;</span><span style="color: #005a5f;">OrbitalCoefficients</span><span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">coefficients</span>;
<span style="color: #145c33;">}</span>;
<span style="color: #5317ac;">using</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">KBand</span><span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">pair</span><span style="color: #145c33;">&lt;</span><span style="color: #005a5f;">KPoint</span>,<span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">VerticalBand</span><span style="color: #145c33;">&gt;</span>;

<span style="color: #5317ac;">struct</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">WaveDescriptor</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #5317ac;">&lt;</span><span style="color: #005a5f;">KBand</span><span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">bands</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">inline</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #721045;">nKpoints</span><span style="color: #5317ac;">()</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">{</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">return</span><span style="color: #2f4f4f;"> </span>bands.size<span style="color: #005a5f;">()</span>;<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">}</span>
<span style="color: #145c33;">}</span>;

<span style="color: #5317ac;">struct</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">Wavecar</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">WavecarHeader</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">header</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #5317ac;">&lt;</span><span style="color: #005a5f;">WaveDescriptor</span><span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">descriptors</span>;
<span style="color: #145c33;">}</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ec7b60" class="outline-3">
<h3 id="org4ec7b60">Mathematical functions</h3>
<div class="outline-text-3" id="text-org4ec7b60">
</div>
