README.md


<a id="org731e074"></a>

### Products

    CellVector crossProduct(const CellVector &a, const CellVector &b) {
      return
        { a[1] * b[2] - a[2] * b[1]
        , a[2] * b[0] - a[0] * b[2]
        , a[0] * b[1] - a[1] * b[0]
        };
    }
    
    double dotProduct(const CellVector &a, const CellVector &b) {
      return std::inner_product(a.begin(), a.end(), b.begin(), 0.0);
    }


<a id="org8423af0"></a>

### Cell volume

We can use the products to calculate the cell volume given by a basis

    double cellVolume(const Cell &c) {
      return
        dotProduct( c.basis[0]
                  , crossProduct( c.basis[1]
                                , c.basis[2]
                                )
                  );
    }


<a id="org481b2e5"></a>

### Reciprocal cell

Here we calculate the reciprocal cell of a given cell

    Cell reciprocalCell(const Cell &c) {
      Cell r;
      for (size_t i=0; i<3; i++) {
        auto itB(r.basis[i].begin());
        r.basis[i] = crossProduct( c.basis[(i+1) % 3]
                                 , c.basis[(i+2) % 3]);
        std::transform( itB, itB + 3, itB
                      , [&c](double i){ return i*2*M_PI/c.volume; });
      }
      r.volume = cellVolume(r);
      return r;
    }


<a id="org5468295"></a>

## `WAVECAR` parsing
