README.md


<a id="org939287a"></a>

### Understanding the code

It can be quite challenging sometimes to understand binary formats
coming from Fortran, or binary formats in general. It is quite instructive
to peek into the binary structure of the files and try to
backwards engineer the main structure of the file.

Here is an excerpt of a hexdump of a typical `VASP5` format `WAVECAR` file:

<div class="figure" id="org22effdb">
<pre class="example" id="org6a21e79">
                  BYTES      
 ADDRESS  1 2  3 4  4 6  7 8  | Comments
==============================|=========
00000000: 0000 0000 0018 d940 | Fortran record length
00000008: 0000 0000 0000 f03f | number of spin channels
00000010: 0000 0000 8006 ea40 | format version (RTAG)
00000018: 0000 0000 0000 0000 |
*                               (zero padding)
00006460: 0000 0000 0000 f03f | Number of k-points
00006468: 0000 0000 0020 b940 | Number of bands
00006470: 0000 0000 00e0 8540 | ENCUT
00006478: ba49 0c02 2b07 1140 | a[1,1] (lattice vectors)
00006480: ba49 0c02 2b07 1140 | a[1,2]
00006488: 0000 0000 0000 0000 | a[1,3]
00006490: 0000 0000 0000 0000 | a[2,1]
00006498: ba49 0c02 2b07 1140 | a[2,2]
000064a0: ba49 0c02 2b07 1140 | a[2,3]
000064a8: ba49 0c02 2b07 1140 | a[3,1]
000064b0: 0000 0000 0000 0000 | a[3,2]
000064b8: ba49 0c02 2b07 1140 | a[3,3]
000064c0: 1a6f 1d53 35e9 0540 | fermi energy
000064c8: 0000 0000 0000 0000 |
*                               (zero padding)
0000c8c0: 0000 0000 0018 a940 | number of plane waves
0000c8c8: 0000 0000 0000 0000 | kpoint[0]  \
0000c8d0: 0000 0000 0000 0000 | kpoint[1]   &gt; Gamma point
0000c8d8: 0000 0000 0000 0000 | kpoint[2]  /
0000c8e0: f1e1 932b 1cee 56c0 | energy-real     x
0000c8e8: 0000 0000 0000 0000 | energy-complex  0
0000c8f0: 0000 0000 0000 f03f | occupation      1
</pre>

</div>

Here there are a couple of things we should remark,

-   `VASP5` format writes out everything using floating point numbers,
    even quantities that ought to be integers, this is done so that the
    binary format is compatible throughout machines (and most programming
    languages) since they follow IEEE standards.
-   Fortran can use an offset to read different parts of a file
    separated in records. The first quantity we get in the `WAVECAR`
    is this record length. In this particular case it is equal
    to `25696` or `0x6460` in hexadecimal notation.
    Notice that this is equal the address where the `WAVECAR`
    header begins by providing the number of \( k \)-points.
-   The second time this record length arises, is when
    the first chunk of data for the wavefunction arises, i.e.
    `2*25696 = 0xc8c0`, where we obtain for the first spin
    channel and first \( k \)-point
    -   the number of plane-waves
    -   the real part of the eigenenergies
    -   the complex part of the eigenenergies
    -   the occupation numbers
    -   the plane-wave coefficients.
