README.html

<div id="outline-container-org9278043" class="outline-4">
<h4 id="org9278043">Wave descriptor</h4>
<div class="outline-text-4" id="text-org9278043">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #005a5f;">KBand</span>
<span style="color: #721045;">readWaveWaveDescriptor</span><span style="color: #145c33;">(</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">string</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">fileName</span>
<span style="color: #2f4f4f;">                      </span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">WavecarHeader</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">header</span>
<span style="color: #2f4f4f;">                      </span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">spinIndex</span>
<span style="color: #2f4f4f;">                      </span><span style="color: #145c33;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>

<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #5317ac;">&lt;</span><span style="color: #005a5f;">double</span><span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">realEnergies</span><span style="color: #5317ac;">(</span>header.nBands<span style="color: #5317ac;">)</span>
<span style="color: #2f4f4f;">    </span>,<span style="color: #2f4f4f;"> </span><span style="color: #00538b;">imagEnergies</span><span style="color: #5317ac;">(</span>header.nBands<span style="color: #5317ac;">)</span>
<span style="color: #2f4f4f;">    </span>,<span style="color: #2f4f4f;"> </span><span style="color: #00538b;">occupancies</span><span style="color: #5317ac;">(</span>header.nBands<span style="color: #5317ac;">)</span>
<span style="color: #2f4f4f;">    </span>;

<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">double</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">buffer</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">fstream</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">file</span><span style="color: #5317ac;">(</span>fileName,<span style="color: #2f4f4f;"> </span><span style="color: #0000c0;">std</span>::<span style="color: #0000c0;">ios</span>::binary<span style="color: #2f4f4f;"> </span>|<span style="color: #2f4f4f;"> </span><span style="color: #0000c0;">std</span>::<span style="color: #0000c0;">ios</span>::in<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">numberPlaneWaves</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">CellVector</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">kpoint</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #5317ac;">&lt;</span>OrbitalCoefficients<span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">coefficients</span>;

<span style="color: #2f4f4f;">  </span>file.seekg<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span>spinIndex<span style="color: #2f4f4f;"> </span>+<span style="color: #2f4f4f;"> </span>2<span style="color: #005a5f;">)</span><span style="color: #2f4f4f;"> </span>*<span style="color: #2f4f4f;"> </span>header.recordLength<span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span><span style="color: #505050;">//</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">read</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">numberPlaneWaves</span>
<span style="color: #2f4f4f;">  </span>file.read<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;buffer,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>numberPlaneWaves<span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>size_t<span style="color: #5317ac;">(</span>buffer<span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span><span style="color: #505050;">//</span><span style="color: #505050;">C.resize(header.nBands</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">*</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">numberPlaneWaves);</span>

<span style="color: #2f4f4f;">  </span>file.read<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;kpoint,<span style="color: #2f4f4f;"> </span>3*<span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">for</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">(</span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">n</span>=0;<span style="color: #2f4f4f;"> </span>n<span style="color: #2f4f4f;"> </span>&lt;<span style="color: #2f4f4f;"> </span>header.nBands;<span style="color: #2f4f4f;"> </span>n++<span style="color: #5317ac;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">{</span>
<span style="color: #2f4f4f;">    </span>file.read<span style="color: #005a5f;">(</span><span style="color: #863927;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #863927;">)(</span>realEnergies.data<span style="color: #0000c0;">()</span><span style="color: #2f4f4f;"> </span>+<span style="color: #2f4f4f;"> </span>n<span style="color: #863927;">)</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #863927;">(</span><span style="color: #005a5f;">double</span><span style="color: #863927;">)</span><span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">    </span>file.read<span style="color: #005a5f;">(</span><span style="color: #863927;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #863927;">)(</span>imagEnergies.data<span style="color: #0000c0;">()</span><span style="color: #2f4f4f;"> </span>+<span style="color: #2f4f4f;"> </span>n<span style="color: #863927;">)</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #863927;">(</span><span style="color: #005a5f;">double</span><span style="color: #863927;">)</span><span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">    </span>file.read<span style="color: #005a5f;">(</span><span style="color: #863927;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #863927;">)(</span>occupancies.data<span style="color: #0000c0;">()</span><span style="color: #2f4f4f;"> </span>+<span style="color: #2f4f4f;"> </span>n<span style="color: #863927;">)</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #863927;">(</span><span style="color: #005a5f;">double</span><span style="color: #863927;">)</span><span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">}</span>

<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">for</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">(</span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">n</span>=0;<span style="color: #2f4f4f;"> </span>n<span style="color: #2f4f4f;"> </span>&lt;<span style="color: #2f4f4f;"> </span>header.nBands;<span style="color: #2f4f4f;"> </span>n++<span style="color: #5317ac;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">{</span>
<span style="color: #2f4f4f;">    </span><span style="color: #005a5f;">OrbitalCoefficients</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">C</span>;
<span style="color: #2f4f4f;">    </span>C.resize<span style="color: #005a5f;">(</span>numberPlaneWaves<span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">    </span>coefficients.push_back<span style="color: #005a5f;">(</span>C<span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">    </span>file.read<span style="color: #005a5f;">(</span><span style="color: #863927;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #863927;">)</span>C.data<span style="color: #863927;">()</span>,<span style="color: #2f4f4f;"> </span>numberPlaneWaves<span style="color: #2f4f4f;"> </span>*<span style="color: #2f4f4f;"> </span>2<span style="color: #2f4f4f;"> </span>*<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #863927;">(</span><span style="color: #005a5f;">double</span><span style="color: #863927;">)</span><span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">}</span>

<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">return</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">{</span><span style="color: #2f4f4f;"> </span>kpoint
<span style="color: #2f4f4f;">         </span>,<span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">{</span>realEnergies,<span style="color: #2f4f4f;"> </span>imagEnergies,<span style="color: #2f4f4f;"> </span>occupancies,<span style="color: #2f4f4f;"> </span>coefficients<span style="color: #005a5f;">}</span>
<span style="color: #2f4f4f;">         </span><span style="color: #5317ac;">}</span>;

<span style="color: #145c33;">}</span>
</pre>
</div>
</div>
</div>
