README.md


<a id="org89a32b3"></a>

### Wave descriptor

    KBand
    readWaveWaveDescriptor( const std::string &fileName
                          , const WavecarHeader &header
                          , const size_t &spinIndex
                          ) {
    
      std::vector<double> realEnergies(header.nBands)
        , imagEnergies(header.nBands)
        , occupancies(header.nBands)
        ;
    
      double buffer;
      std::fstream file(fileName, std::ios::binary | std::ios::in);
      size_t numberPlaneWaves;
      CellVector kpoint;
      std::vector<OrbitalCoefficients> coefficients;
    
      file.seekg((spinIndex + 2) * header.recordLength);
    
      // read numberPlaneWaves
      file.read((char*)&buffer, sizeof(double));
      numberPlaneWaves = size_t(buffer);
    
      //C.resize(header.nBands * numberPlaneWaves);
    
      file.read((char*)&kpoint, 3*sizeof(double));
    
      for (size_t n=0; n < header.nBands; n++) {
        file.read((char*)(realEnergies.data() + n), sizeof(double));
        file.read((char*)(imagEnergies.data() + n), sizeof(double));
        file.read((char*)(occupancies.data() + n), sizeof(double));
      }
    
      for (size_t n=0; n < header.nBands; n++) {
        OrbitalCoefficients C;
        C.resize(numberPlaneWaves);
        coefficients.push_back(C);
        file.read((char*)C.data(), numberPlaneWaves * 2 * sizeof(double));
      }
    
      return { kpoint
             , {realEnergies, imagEnergies, occupancies, coefficients}
             };
    
    }
