README.html

<div id="outline-container-org64614c5" class="outline-4">
<h4 id="org64614c5">Header</h4>
<div class="outline-text-4" id="text-org64614c5">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #005a5f;">WavecarHeader</span><span style="color: #2f4f4f;"> </span><span style="color: #721045;">readWavecarHeader</span><span style="color: #145c33;">(</span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">string</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">fileName</span><span style="color: #145c33;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">WavecarHeader</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">header</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">fstream</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">file</span><span style="color: #5317ac;">(</span>fileName,<span style="color: #2f4f4f;"> </span><span style="color: #0000c0;">std</span>::<span style="color: #0000c0;">ios</span>::binary<span style="color: #2f4f4f;"> </span>|<span style="color: #2f4f4f;"> </span><span style="color: #0000c0;">std</span>::<span style="color: #0000c0;">ios</span>::in<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #005a5f;">double</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">buffer</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #5317ac;">&lt;</span><span style="color: #005a5f;">double</span><span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">vvbuffer</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #505050;">//</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">double</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">hbarConst</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">=</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">0.26246582250210965422;</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">//</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">1/eV</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">Ang^2</span>

<span style="color: #2f4f4f;">  </span>assert<span style="color: #5317ac;">(</span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #2f4f4f;"> </span>==<span style="color: #2f4f4f;"> </span>8<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>assert<span style="color: #5317ac;">(</span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span>header.real.basis<span style="color: #005a5f;">)</span><span style="color: #2f4f4f;"> </span>==<span style="color: #2f4f4f;"> </span>72<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>assert<span style="color: #5317ac;">(</span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span>CellVector<span style="color: #005a5f;">)</span><span style="color: #2f4f4f;"> </span>==<span style="color: #2f4f4f;"> </span>3<span style="color: #2f4f4f;"> </span>*<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span>file.read<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;buffer,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>header.recordLength<span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>size_t<span style="color: #5317ac;">(</span>buffer<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>file.read<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;buffer,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>header.nSpin<span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>size_t<span style="color: #5317ac;">(</span>buffer<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>file.read<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;buffer,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>header.version<span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>size_t<span style="color: #5317ac;">(</span>buffer<span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">if</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">(</span>header.version<span style="color: #2f4f4f;"> </span>!=<span style="color: #2f4f4f;"> </span>53300<span style="color: #5317ac;">)</span>
<span style="color: #2f4f4f;">    </span><span style="color: #5317ac;">throw</span><span style="color: #2f4f4f;"> </span><span style="color: #2544bb;">"This</span><span style="color: #2f4f4f;"> </span><span style="color: #2544bb;">program</span><span style="color: #2f4f4f;"> </span><span style="color: #2544bb;">only</span><span style="color: #2f4f4f;"> </span><span style="color: #2544bb;">supports</span><span style="color: #2f4f4f;"> </span><span style="color: #2544bb;">VASP5</span><span style="color: #2f4f4f;"> </span><span style="color: #2544bb;">format</span><span style="color: #2f4f4f;"> </span><span style="color: #2544bb;">(RTAG:</span><span style="color: #2f4f4f;"> </span><span style="color: #2544bb;">53300)"</span>;

<span style="color: #2f4f4f;">  </span>file.seekg<span style="color: #5317ac;">(</span>header.recordLength<span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span>file.read<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;buffer,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>header.nKpoints<span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>size_t<span style="color: #5317ac;">(</span>buffer<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>file.read<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;buffer,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>header.nBands<span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>size_t<span style="color: #5317ac;">(</span>buffer<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>file.read<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;buffer,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>header.encut<span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>size_t<span style="color: #5317ac;">(</span>buffer<span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span><span style="color: #505050;">//</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">Setup</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">real</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">cell</span>
<span style="color: #2f4f4f;">  </span>file.read<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;header.real.basis,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span>header.real.basis<span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>header.real.volume<span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>cellVolume<span style="color: #5317ac;">(</span>header.real<span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span>file.read<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;buffer,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>header.eFermi<span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>buffer;

<span style="color: #2f4f4f;">  </span><span style="color: #505050;">//</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">Setup</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">Reciprocal</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">cell</span>
<span style="color: #2f4f4f;">  </span>header.reciprocal<span style="color: #2f4f4f;"> </span>=<span style="color: #2f4f4f;"> </span>reciprocalCell<span style="color: #5317ac;">(</span>header.real<span style="color: #5317ac;">)</span>;



<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">return</span><span style="color: #2f4f4f;"> </span>header;
<span style="color: #145c33;">}</span>
</pre>
</div>
</div>
</div>
