README.md


<a id="org4fea553"></a>

### Header

    WavecarHeader readWavecarHeader(const std::string &fileName) {
      WavecarHeader header;
      std::fstream file(fileName, std::ios::binary | std::ios::in);
      double buffer;
      std::vector<double> vvbuffer;
    
      assert(sizeof(double) == 8);
      assert(sizeof(header.real.basis) == 72);
      assert(sizeof(CellVector) == 3 * sizeof(double));
    
      file.read((char*)&buffer, sizeof(double));
      header.recordLength = size_t(buffer);
      file.read((char*)&buffer, sizeof(double));
      header.nSpin = size_t(buffer);
      file.read((char*)&buffer, sizeof(double));
      header.version = size_t(buffer);
    
      if (header.version != 53300)
        throw "This program only supports VASP5 format (RTAG: 53300)";
    
      file.seekg(header.recordLength);
    
      file.read((char*)&buffer, sizeof(double));
      header.nKpoints = size_t(buffer);
      file.read((char*)&buffer, sizeof(double));
      header.nBands = size_t(buffer);
      file.read((char*)&buffer, sizeof(double));
      header.encut = size_t(buffer);
    
      // Setup real cell
      file.read((char*)&header.real.basis, sizeof(header.real.basis));
      header.real.volume = cellVolume(header.real);
    
      file.read((char*)&buffer, sizeof(double));
      header.eFermi = buffer;
    
      // Setup Reciprocal cell
      header.reciprocal = reciprocalCell(header.real);
    
    
    
      return header;
    }
