README.html

<div id="outline-container-orgdc45c33" class="outline-4">
<h4 id="orgdc45c33">The whole <code>WAVECAR</code></h4>
<div class="outline-text-4" id="text-orgdc45c33">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #005a5f;">Wavecar</span><span style="color: #2f4f4f;"> </span><span style="color: #721045;">readWavecar</span><span style="color: #145c33;">(</span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">string</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">fileName</span><span style="color: #145c33;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">auto</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">header</span><span style="color: #5317ac;">(</span>readWavecarHeader<span style="color: #005a5f;">(</span>fileName<span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">vector</span><span style="color: #5317ac;">&lt;</span>WaveDescriptor<span style="color: #5317ac;">&gt;</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">descriptors</span>;

<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">for</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">(</span><span style="color: #005a5f;">uint8_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">i</span>=0;<span style="color: #2f4f4f;"> </span>i<span style="color: #2f4f4f;"> </span>&lt;<span style="color: #2f4f4f;"> </span>header.nSpin;<span style="color: #2f4f4f;"> </span>i++<span style="color: #5317ac;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">{</span>
<span style="color: #2f4f4f;">    </span><span style="color: #005a5f;">WaveDescriptor</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">descriptor</span>;
<span style="color: #2f4f4f;">    </span><span style="color: #5317ac;">for</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">k</span>=0;<span style="color: #2f4f4f;"> </span>k<span style="color: #2f4f4f;"> </span>&lt;<span style="color: #2f4f4f;"> </span>header.nKpoints;<span style="color: #2f4f4f;"> </span>k++<span style="color: #005a5f;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">{</span>
<span style="color: #2f4f4f;">      </span><span style="color: #5317ac;">auto</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">kBand</span><span style="color: #863927;">(</span>readWaveWaveDescriptor<span style="color: #0000c0;">(</span>fileName,<span style="color: #2f4f4f;"> </span>header,<span style="color: #2f4f4f;"> </span>i<span style="color: #0000c0;">)</span><span style="color: #863927;">)</span>;
<span style="color: #2f4f4f;">      </span>descriptor.bands.push_back<span style="color: #863927;">(</span>kBand<span style="color: #863927;">)</span>;
<span style="color: #2f4f4f;">    </span><span style="color: #005a5f;">}</span>
<span style="color: #2f4f4f;">    </span>descriptors.push_back<span style="color: #005a5f;">(</span>descriptor<span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">}</span>
<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">return</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">{</span>header,<span style="color: #2f4f4f;"> </span>descriptors<span style="color: #5317ac;">}</span>;

<span style="color: #145c33;">}</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org9212da8" class="outline-3">
<h3 id="org9212da8"><code>WAVECAR</code> writing</h3>
<div class="outline-text-3" id="text-org9212da8">
<p>
Our writer writes <code>WAVECAR</code> files in the <code>VASP5</code> version.
</p>
</div>

<div id="outline-container-orgc91b19e" class="outline-4">
<h4 id="orgc91b19e"><code>CellVector</code></h4>
<div class="outline-text-4" id="text-orgc91b19e">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #005a5f;">void</span><span style="color: #2f4f4f;"> </span><span style="color: #721045;">writeToWavecar</span><span style="color: #145c33;">(</span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">ofstream</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">f</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">CellVector</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">v</span><span style="color: #145c33;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span>f.write<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>v.data<span style="color: #005a5f;">()</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span>CellVector<span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #145c33;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgea788c4" class="outline-4">
<h4 id="orgea788c4"><code>Cell</code></h4>
<div class="outline-text-4" id="text-orgea788c4">
<p>
In the case of a cell we only write the basis elements in order,
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #005a5f;">void</span><span style="color: #2f4f4f;"> </span><span style="color: #721045;">writeToWavecar</span><span style="color: #145c33;">(</span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">ofstream</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">f</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">Cell</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">c</span><span style="color: #145c33;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">for</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">(</span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">auto</span>&amp;<span style="color: #2f4f4f;"> </span><span style="color: #00538b;">v</span>:<span style="color: #2f4f4f;"> </span>c.basis<span style="color: #5317ac;">)</span><span style="color: #2f4f4f;"> </span>writeToWavecar<span style="color: #5317ac;">(</span>f,<span style="color: #2f4f4f;"> </span>v<span style="color: #5317ac;">)</span>;
<span style="color: #145c33;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org126ed2f" class="outline-4">
<h4 id="org126ed2f"><code>WavecarHeader</code></h4>
<div class="outline-text-4" id="text-org126ed2f">
<p>
In the case of the <code>WavecarHeader</code> we have to make sure the order is the
correct one that <code>VASP</code> is expecting.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #005a5f;">void</span><span style="color: #2f4f4f;"> </span><span style="color: #721045;">writeToWavecar</span><span style="color: #145c33;">(</span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">ofstream</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">f</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">WavecarHeader</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">h</span><span style="color: #145c33;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">auto</span><span style="color: #2f4f4f;"> </span>writeInt
<span style="color: #2f4f4f;">    </span>=<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">[</span>&amp;<span style="color: #00538b;">f</span><span style="color: #5317ac;">](</span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">i</span><span style="color: #5317ac;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">{</span>
<span style="color: #2f4f4f;">        </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">double</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">j</span><span style="color: #005a5f;">(</span>i<span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">        </span>f.write<span style="color: #005a5f;">(</span><span style="color: #863927;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #863927;">)</span>&amp;j,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #863927;">(</span><span style="color: #005a5f;">double</span><span style="color: #863927;">)</span><span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">    </span><span style="color: #5317ac;">}</span>;
<span style="color: #2f4f4f;">  </span>writeInt<span style="color: #5317ac;">(</span>h.recordLength<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>writeInt<span style="color: #5317ac;">(</span>h.nSpin<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>writeInt<span style="color: #5317ac;">(</span>h.version<span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span>f.seekp<span style="color: #5317ac;">(</span>h.recordLength<span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span>writeInt<span style="color: #5317ac;">(</span>h.nKpoints<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>writeInt<span style="color: #5317ac;">(</span>h.nBands<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>writeInt<span style="color: #5317ac;">(</span>h.encut<span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span>writeToWavecar<span style="color: #5317ac;">(</span>f,<span style="color: #2f4f4f;"> </span>h.real<span style="color: #5317ac;">)</span>;
<span style="color: #2f4f4f;">  </span>f.write<span style="color: #5317ac;">(</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #005a5f;">)</span>&amp;h.eFermi,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">double</span><span style="color: #005a5f;">)</span><span style="color: #5317ac;">)</span>;
<span style="color: #145c33;">}</span>
</pre>
</div>
</div>
</div>
