README.md


<a id="org906b4c2"></a>

### The whole `WAVECAR`

    Wavecar readWavecar(const std::string &fileName) {
      auto header(readWavecarHeader(fileName));
      std::vector<WaveDescriptor> descriptors;
    
      for (size_t i=0; i < header.nSpin; i++) {
        WaveDescriptor descriptor;
        for (size_t k=0; k < header.nKpoints; k++) {
          auto kBand(readWaveWaveDescriptor(fileName, header, i));
          descriptor.bands.push_back(kBand);
        }
        descriptors.push_back(descriptor);
      }
      return {header, descriptors};
    
    }


<a id="org111baee"></a>

## `WAVECAR` writing

Our writer writes `WAVECAR` files in the `VASP5` version.


<a id="org6e7cd55"></a>

### `CellVector`

    void writeToWavecar(std::ofstream &f, const CellVector &v) {
      f.write((char*)v.data(), sizeof(CellVector));
    }


<a id="org9cbab66"></a>

### `Cell`

In the case of a cell we only write the basis elements in order,

    void writeToWavecar(std::ofstream &f, const Cell &c) {
      for (const auto& v: c.basis) writeToWavecar(f, v);
    }


<a id="orgd4bbead"></a>

### `WavecarHeader`

In the case of the `WavecarHeader` we have to make sure the order is the
correct one that `VASP` is expecting.

    void writeToWavecar(std::ofstream &f, const WavecarHeader &h) {
      const auto writeInt
        = [&f](const size_t &i) {
            const double j(i);
            f.write((char*)&j, sizeof(double));
        };
      writeInt(h.recordLength);
      writeInt(h.nSpin);
      writeInt(h.version);
    
      f.seekp(h.recordLength);
    
      writeInt(h.nKpoints);
      writeInt(h.nBands);
      writeInt(h.encut);
    
      writeToWavecar(f, h.real);
      f.write((char*)&h.eFermi, sizeof(double));
    }
