README.html

<div id="outline-container-org5971b0e" class="outline-4">
<h4 id="org5971b0e"><code>WaveDescriptor</code></h4>
<div class="outline-text-4" id="text-org5971b0e">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #005a5f;">void</span><span style="color: #2f4f4f;"> </span><span style="color: #721045;">writeToWavecar</span><span style="color: #145c33;">(</span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">ofstream</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">f</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">WaveDescriptor</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">d</span><span style="color: #145c33;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">for</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">(</span><span style="color: #5317ac;">auto</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">const</span>&amp;<span style="color: #2f4f4f;"> </span><span style="color: #00538b;">kband</span>:<span style="color: #2f4f4f;"> </span>d.bands<span style="color: #5317ac;">)</span><span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">{</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">//</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">spin</span><span style="color: #2f4f4f;"> </span><span style="color: #505050;">loop</span>
<span style="color: #2f4f4f;">    </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">auto</span>&amp;<span style="color: #2f4f4f;"> </span><span style="color: #00538b;">kVector</span><span style="color: #005a5f;">(</span>kband.first<span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">    </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">auto</span>&amp;<span style="color: #2f4f4f;"> </span><span style="color: #00538b;">vband</span><span style="color: #005a5f;">(</span>kband.second<span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">    </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">double</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">numberPlaneWaves</span><span style="color: #005a5f;">(</span>vband.coefficients<span style="color: #863927;">[</span>0<span style="color: #863927;">]</span>.size<span style="color: #863927;">()</span><span style="color: #005a5f;">)</span>;

<span style="color: #2f4f4f;">    </span>f.write<span style="color: #005a5f;">(</span><span style="color: #863927;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #863927;">)</span>&amp;numberPlaneWaves,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #863927;">(</span><span style="color: #005a5f;">double</span><span style="color: #863927;">)</span><span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">    </span>writeToWavecar<span style="color: #005a5f;">(</span>f,<span style="color: #2f4f4f;"> </span>kVector<span style="color: #005a5f;">)</span>;

<span style="color: #2f4f4f;">    </span><span style="color: #5317ac;">for</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">n</span><span style="color: #863927;">(</span>0<span style="color: #863927;">)</span>;<span style="color: #2f4f4f;"> </span>n<span style="color: #2f4f4f;"> </span>&lt;<span style="color: #2f4f4f;"> </span>vband.realEnergies.size<span style="color: #863927;">()</span>;<span style="color: #2f4f4f;"> </span>n++<span style="color: #005a5f;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">{</span>
<span style="color: #2f4f4f;">      </span>f.write<span style="color: #863927;">(</span><span style="color: #0000c0;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #0000c0;">)</span>&amp;vband.realEnergies<span style="color: #0000c0;">[</span>n<span style="color: #0000c0;">]</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #0000c0;">(</span><span style="color: #005a5f;">double</span><span style="color: #0000c0;">)</span><span style="color: #863927;">)</span>;
<span style="color: #2f4f4f;">      </span>f.write<span style="color: #863927;">(</span><span style="color: #0000c0;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #0000c0;">)</span>&amp;vband.imagEnergies<span style="color: #0000c0;">[</span>n<span style="color: #0000c0;">]</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #0000c0;">(</span><span style="color: #005a5f;">double</span><span style="color: #0000c0;">)</span><span style="color: #863927;">)</span>;
<span style="color: #2f4f4f;">      </span>f.write<span style="color: #863927;">(</span><span style="color: #0000c0;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #0000c0;">)</span>&amp;vband.occupancies<span style="color: #0000c0;">[</span>n<span style="color: #0000c0;">]</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #0000c0;">(</span><span style="color: #005a5f;">double</span><span style="color: #0000c0;">)</span><span style="color: #863927;">)</span>;
<span style="color: #2f4f4f;">    </span><span style="color: #005a5f;">}</span>

<span style="color: #2f4f4f;">    </span><span style="color: #5317ac;">for</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">(</span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">n</span><span style="color: #863927;">(</span>0<span style="color: #863927;">)</span>;<span style="color: #2f4f4f;"> </span>n<span style="color: #2f4f4f;"> </span>&lt;<span style="color: #2f4f4f;"> </span>vband.realEnergies.size<span style="color: #863927;">()</span>;<span style="color: #2f4f4f;"> </span>n++<span style="color: #005a5f;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">{</span>
<span style="color: #2f4f4f;">      </span>f.write<span style="color: #863927;">(</span><span style="color: #0000c0;">(</span><span style="color: #005a5f;">char</span>*<span style="color: #0000c0;">)</span>vband.coefficients<span style="color: #0000c0;">[</span>n<span style="color: #0000c0;">]</span>.data<span style="color: #0000c0;">()</span>,
<span style="color: #2f4f4f;">              </span>numberPlaneWaves<span style="color: #2f4f4f;"> </span>*<span style="color: #2f4f4f;"> </span>2<span style="color: #2f4f4f;"> </span>*<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">sizeof</span><span style="color: #0000c0;">(</span><span style="color: #005a5f;">double</span><span style="color: #0000c0;">)</span><span style="color: #863927;">)</span>;
<span style="color: #2f4f4f;">    </span><span style="color: #005a5f;">}</span>

<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">}</span>
<span style="color: #145c33;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc913909" class="outline-4">
<h4 id="orgc913909"><code>Wavecar</code></h4>
<div class="outline-text-4" id="text-orgc913909">
<p>
Writing a <code>WAVECAR</code> consists in writing first the header
and then the wave descriptor.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #005a5f;">void</span><span style="color: #2f4f4f;"> </span><span style="color: #721045;">writeToWavecar</span><span style="color: #145c33;">(</span><span style="color: #0000c0;">std</span>::<span style="color: #005a5f;">ofstream</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">f</span>,<span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">const</span><span style="color: #2f4f4f;"> </span><span style="color: #005a5f;">Wavecar</span><span style="color: #2f4f4f;"> </span>&amp;<span style="color: #00538b;">w</span><span style="color: #145c33;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #145c33;">{</span>
<span style="color: #2f4f4f;">  </span>writeToWavecar<span style="color: #5317ac;">(</span>f,<span style="color: #2f4f4f;"> </span>w.header<span style="color: #5317ac;">)</span>;

<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">for</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">(</span><span style="color: #005a5f;">size_t</span><span style="color: #2f4f4f;"> </span><span style="color: #00538b;">ispin</span><span style="color: #005a5f;">(</span>0<span style="color: #005a5f;">)</span>;<span style="color: #2f4f4f;"> </span>ispin<span style="color: #2f4f4f;"> </span>&lt;<span style="color: #2f4f4f;"> </span>w.descriptors.size<span style="color: #005a5f;">()</span>;<span style="color: #2f4f4f;"> </span>ispin++<span style="color: #5317ac;">)</span><span style="color: #2f4f4f;"> </span><span style="color: #5317ac;">{</span>
<span style="color: #2f4f4f;">    </span>f.seekp<span style="color: #005a5f;">(</span><span style="color: #863927;">(</span>ispin<span style="color: #2f4f4f;"> </span>+<span style="color: #2f4f4f;"> </span>2<span style="color: #863927;">)</span><span style="color: #2f4f4f;"> </span>*<span style="color: #2f4f4f;"> </span>w.header.recordLength<span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">    </span>writeToWavecar<span style="color: #005a5f;">(</span>f,<span style="color: #2f4f4f;"> </span>w.descriptors<span style="color: #863927;">[</span>ispin<span style="color: #863927;">]</span><span style="color: #005a5f;">)</span>;
<span style="color: #2f4f4f;">  </span><span style="color: #5317ac;">}</span>

<span style="color: #145c33;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
