README.md


<a id="orgd3006d9"></a>

### `WaveDescriptor`

    void writeToWavecar(std::ofstream &f, const WaveDescriptor &d) {
      for (auto const& kband: d.bands)  { // spin loop
        const auto& kVector(kband.first);
        const auto& vband(kband.second);
        const double numberPlaneWaves(vband.coefficients[0].size());
    
        f.write((char*)&numberPlaneWaves, sizeof(double));
        writeToWavecar(f, kVector);
    
        for (size_t n(0); n < vband.realEnergies.size(); n++) {
          f.write((char*)&vband.realEnergies[n], sizeof(double));
          f.write((char*)&vband.imagEnergies[n], sizeof(double));
          f.write((char*)&vband.occupancies[n], sizeof(double));
        }
    
        for (size_t n(0); n < vband.realEnergies.size(); n++) {
          f.write((char*)vband.coefficients[n].data(),
                  numberPlaneWaves * 2 * sizeof(double));
        }
    
      }
    }


<a id="orgd84474a"></a>

### `Wavecar`

Writing a `WAVECAR` consists in writing first the header
and then the wave descriptor.

    void writeToWavecar(std::ofstream &f, const Wavecar &w) {
      writeToWavecar(f, w.header);
    
      for (size_t ispin(0); ispin < w.descriptors.size(); ispin++) {
        f.seekp((ispin + 2) * w.header.recordLength);
        writeToWavecar(f, w.descriptors[ispin]);
      }
    
    }
