README.org
** Main function
  :PROPERTIES:
  :header-args:c+++: :tangle tests/wavecar-show.cpp
  :END:
#+begin_src c++
#include <Wavecar.hpp>

int main (int argc, char **argv) {

  std::cout << ">>> Parsing WAVECAR" << std::endl;
  auto wavecar(readWavecar("WAVECAR"));
  auto& header(wavecar.header);

  std::cout << "recordLength: " << header.recordLength << "\n"
            << "nSpin: " << header.nSpin << "\n"
            << "version: " << header.version << "\n"
            << "nKpoints: " << header.nKpoints << "\n"
            << "nBands: " << header.nBands << "\n"
            << "encut: " << header.encut << "\n"
            << "eFermi: " << header.eFermi << "\n"
            << "volume: " << header.real.volume << "\n"
            << "\n";

  std::cout << ">>> Creating grids" << std::endl;
  auto grids(mkGrid(wavecar));
  std::cout << grids.size() << " grids created" << std::endl;

  std::cout << "Lattice vectors: \n";
  for (const auto &b: header.real.basis)
    printf("  %f %f %f\n", b[0], b[1], b[2]);

  std::cout << "Reciprocal vectors: \n";
  for (const auto &b: header.reciprocal.basis)
    printf("  %f %f %f\n", b[0], b[1], b[2]);

  auto wavecar2(std::ofstream("WAVECAR-2", std::ios::binary));
  std::cout << "Writing WAVECAR-2" << std::endl;
  writeToWavecar(wavecar2, wavecar);

}
#+end_src






bibliographystyle:unsrt
bibliography:README.bib
#+begin: papis-bibtex-refs :tangle /home/gallo/software/wavecar.hpp/README.bib
#+begin_src bibtex :exports none :tangle /home/gallo/software/wavecar.hpp/README.bib
@article{LiteratePrograKnuth1984,
  author = {Knuth, D. E.},
  doi = {10.1093/comjnl/27.2.97},
  issn = {0010-4620},
  issue = {2},
  journal = {The Computer Journal},
  language = {en},
  month = {2},
  pages = {97--111},
  publisher = {Oxford University Press (OUP)},
  title = {Literate Programming},
  url = {http://dx.doi.org/10.1093/comjnl/27.2.97},
  volume = {27},
  year = {1984},
}

#+end_src

#+
