README.md


<a id="org5e403e8"></a>

# Tests


<a id="orge7e89d3"></a>

## Main function

    #include <Wavecar.hpp>
    
    int main (int argc, char **argv) {
    
      std::cout << ">>> Parsing WAVECAR" << std::endl;
      auto wavecar(readWavecar("WAVECAR"));
      auto& header(wavecar.header);
    
      std::cout << "recordLength: " << header.recordLength << "\n"
                << "nSpin: " << header.nSpin << "\n"
                << "version: " << header.version << "\n"
                << "nKpoints: " << header.nKpoints << "\n"
                << "nBands: " << header.nBands << "\n"
                << "encut: " << header.encut << "\n"
                << "eFermi: " << header.eFermi << "\n"
                << "volume: " << header.real.volume << "\n"
                << "\n";
    
      std::cout << ">>> Creating grids" << std::endl;
      auto grids(mkGrid(wavecar));
      std::cout << grids.size() << " grids created" << std::endl;
    
      std::cout << "Lattice vectors: \n";
      for (const auto &b: header.real.basis)
        printf("  %f %f %f\n", b[0], b[1], b[2]);
    
      std::cout << "Reciprocal vectors: \n";
      for (const auto &b: header.reciprocal.basis)
        printf("  %f %f %f\n", b[0], b[1], b[2]);
    
      auto wavecar2(std::ofstream("WAVECAR-2", std::ios::binary));
      std::cout << "Writing WAVECAR-2" << std::endl;
      writeToWavecar(wavecar2, wavecar);
    
    }


# Bibliography
<a id="LiteratePrograKnuth1984"></a>[LiteratePrograKnuth1984] Knuth, Literate Programming, <i>The Computer Journal</i>, <b>27</b>, 97-111 (1984). <a href="http://dx.doi.org/10.1093/comjnl/27.2.97">link</a>. <a href="http://dx.doi.org/10.1093/comjnl/27.2.97">doi</a>. [↩](#39f041f6b1d2d698620dbd1d6c83c888)

\#+begin: papis-bibtex-refs :tangle /home/gallo/software/wavecar.hpp/README.bib
\#+end<sub>src</sub>

